In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv('insurance.csv')

# DATA PROFILING AND PREPARATION

In [3]:
df.head()

    age     sex     bmi  children smoker     region       charges
0  19.0  female  27.900       0.0    yes  southwest     16884.924
1  18.0    male  33.770       1.0     no  Southeast     1725.5523
2  28.0    male  33.000       3.0     no  southeast     $4449.462
3  33.0    male  22.705       0.0     no  northwest  $21984.47061
4  32.0    male  28.880       0.0     no  northwest    $3866.8552

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1272 non-null   float64
 1   sex       1272 non-null   object
 2   bmi       1272 non-null   float64
 3   children  1272 non-null   float64
 4   smoker    1272 non-null   object
 5   region    1272 non-null   object
 6   charges   1284 non-null   object
dtypes: float64(3), object(4)
memory usage: 73.3+ KB

## Checking unique values and count in each column.

In [5]:
#Assigning all column names to a variable "cols"
cols= df.columns
# printing unique values in each column using for loop
for col in cols:
    print(col)
    
    unique= df[col].unique
    print(unique,'\n=============================\n\n')

age
<bound method Series.unique of 0       19.0
1       18.0
2       28.0
3       33.0
4       32.0
        ...
1333    50.0
1334   -18.0
1335    18.0
1336    21.0
1337    61.0
Name: age, Length: 1338, dtype: float64>
=============================


sex
<bound method Series.unique of 0       female
1         male
2         male
3         male
4         male
         ...
1333      male
1334    female
1335    female
1336    female
1337    female
Name: sex, Length: 1338, dtype: object>
=============================


bmi
<bound method Series.unique of 0       27.900
1       33.770
2       33.000
3       22.705
4       28.880
         ...
1333    30.970
1334    31.920
1335    36.850
1336    25.800
1337    29.070
Name: bmi, Length: 1338, dtype: float64>
=============================


children
<bound method Series.unique of 0       0.0
1       1.0
2       3.0
3       0.0
4       0.0
       ...
1333    3.0
1334    0.0
1335    0.0
1336    0.0
1337    0.0
Name: children, Length: 1338, dtype: float64>
=============================


smoker
<bound method Series.unique of 0       yes
1        no
2        no
3        no
4        no
       ...
1333     no
1334     no
1335     no
1336     no
1337    yes
Name: smoker, Length: 1338, dtype: object>
=============================


region
<bound method Series.unique of 0       southwest
1       Southeast
2       southeast
3       northwest
4       northwest
          ...
1333    Northwest
1334    Northeast
1335    southeast
1336    southwest
1337    northwest
Name: region, Length: 1338, dtype: object>
=============================


charges
<bound method Series.unique of 0          16884.924
1          1725.5523
2          $4449.462
3       $21984.47061
4         $3866.8552
            ...
1333     $10600.5483
1334       2205.9808
1335      $1629.8335
1336        2007.945
1337      29141.3603
Name: charges, Length: 1338, dtype: object>
=============================

In [6]:
for col in cols:
    print(col)

    # get a list of unique values
    unique = df[col].unique()

    if len(unique):
        print(unique, '\n====================================\n\n')
    else:
        print(str(len(unique)) + ' unique values', '\n====================================\n\n')

age
[ 19.  18.  28.  33.  32. -31.  46.  37.  60.  25.  62.  23.  56. -27.
  52. -23.  30. -34.  59.  63.  55.  31.  22.  nan  26.  35.  24.  41.
  21.  48.  36.  40.  58.  34.  43.  64.  20.  61.  27.  53.  44.  57.
 -41.  45. -35.  54.  38.  29.  49.  47.  51.  42.  50. -44. -39. -28.
 -40.  39. -25. -52. -26. -47. -45. -57. -43. -50. -58. -56. -30. -51.
 -60. -37. -55. -64. -22. -36. -21. -18. -20. -19. -33.]
====================================


sex
['female' 'male' 'woman' 'F' 'man' nan 'M']
====================================


bmi
[27.9   33.77  33.    22.705 28.88  25.74  33.44  27.74  29.83  25.84
 26.22  26.29  34.4   39.82  42.13  24.6   30.78  23.845 40.3   35.3
 36.005 32.4   34.1      nan 28.025 27.72  23.085 32.775 17.385 36.3
 35.6   26.315 28.6   28.31  36.4   20.425 32.965 20.8   36.67  39.9
 26.6   36.63  21.78  37.3   38.665 34.77  24.53  35.625 28.    34.43
 28.69  36.955 31.825 31.68  22.88  37.335 27.36  33.66  24.7   25.935
 22.42  28.9   39.1   36.19  23.98  24.75  28.5   28.1   32.01  27.4
 34.01  35.53  39.805 26.885 38.285 37.62  41.23  34.8   22.895 31.16
 27.2   26.98  39.49  24.795 31.3   30.8   38.28  19.95  19.3   31.6
 30.115 29.92  27.5   28.4   30.875 27.94  35.09  33.63  29.7   35.72
 32.205 49.06  27.17  23.37  37.1   23.75  28.975 31.35  33.915 28.785
 28.3   37.4   17.765 34.7   26.505 22.04  35.9   25.555 28.05  25.175
 31.9   36.    32.49  25.3   29.735 38.83  30.495 37.73  37.43  24.13
 37.145 25.46  39.52  24.42  27.83  36.85  39.6   29.8   29.64  28.215
 37.    33.155 18.905 41.47  30.3   15.96  33.345 37.7   27.835 29.2
 28.595 26.41  30.69  41.895 30.9   32.2   32.11  31.57  26.2   30.59
 32.8   18.05  39.33  32.23  24.035 36.08  22.3   26.4   31.8   26.73
 23.1   23.21  33.7   33.25  24.64  33.88  38.06  41.91  31.635 36.195
 17.8   24.51  22.22  29.07  22.135 26.8   30.02  20.9   17.29  34.21
 25.365 40.15  24.415 25.2   26.84  24.32  42.35  19.8   32.395 30.2
 34.2   37.05  27.455 27.55  20.615 24.3   31.79  21.56  28.12  40.565
 27.645 31.2   26.62  48.07  36.765 33.4   45.54  28.82  22.99  27.7
 25.41  22.61  37.51  38.    33.33  34.865 35.86  31.4   25.27  40.945
 34.105 36.48  33.8   36.7   36.385 34.5   32.3   27.6   29.26  23.18
 25.6   35.245 43.89  20.79  30.5   21.7   21.89  32.015 30.4   21.09
 22.23  32.9   24.89  31.46  17.955 30.685 43.34  39.05  30.21  31.445
 19.855 31.02  38.17  20.6   47.52  20.4   24.31  23.6   21.12  30.03
 17.48  20.235 17.195 23.9   35.15  22.6   39.16  27.265 29.165 16.815
 26.9   33.11  31.73  46.75  29.45  32.68  33.5   43.01  36.52  26.695
 33.1   29.6   38.6   23.4   46.53  30.14  30.    28.38  28.7   33.82
 24.09  32.67  25.1   32.56  41.325 39.5   34.3   31.065 21.47  25.08
 43.4   25.7   27.93  39.2   26.03  30.25  28.93  35.7   35.31  31.
 44.22  26.07  25.8   39.425 40.48  38.9   47.41  35.435 46.7   46.2
 21.4   23.8   44.77  32.12  29.1   37.29  36.86  34.295 38.095 23.465
 45.43  23.65  20.7   28.27  35.91  29.    19.57  31.13  21.85  33.725
 29.48  32.6   37.525 23.655 37.8   29.37  19.    21.3   33.535 42.46
 38.95  36.1   29.3   39.7   38.19  42.4   34.96  42.68  35.2   31.54
 29.81  21.375 40.81  17.4   20.3   18.5   26.125 41.69  24.1   36.2
 40.185 35.75  39.27  34.87  44.745 29.545 23.54  40.47  40.66  36.6
 35.4   27.075 28.405 21.755 40.28  30.1   32.1   38.39  23.7   35.5
 29.15  27.    37.905 22.77  22.8   34.58  27.1   19.475 26.7   34.32
 41.14  35.97  22.515 41.8   31.92  26.18  42.24  26.51  35.815 36.575
 42.94  21.01  24.225 17.67  34.39  31.5   31.1   32.78  32.45  50.38
 47.6   25.4   29.9   43.7   24.86  28.8   29.5   29.04  44.    20.045
 40.26  35.1   29.355 32.34  39.8   24.605 33.99  28.2   25.    33.2
 23.2   20.1   32.5   37.18  46.09  39.93  35.8   31.255 18.335 42.9
 26.79  39.615 25.9   25.745 28.16  23.56  40.5   35.42  39.995 34.675
 20.52  23.275 36.29  32.7   19.19  24.985 20.13  23.32  45.32  34.6
 18.715 21.565 38.38  23.    37.07  42.655 21.66  29.59  32.    18.3
 47.74  22.1   19.095 38.94  31.24  29.925 20.35  25.85  42.75  18.6
 23.87  45.9   21.5   30.305 44.88  41.1   40.37  28.49  33.55  40.375
 27.28  17.86  33.3   39.14  21.945 24.97  23.94  34.485 21.8   23.3
 36.96  21.28  29.4   27.3   37.9   37.715 23.76  25.52  27.61  27.06
 39.4   34.9   22.    30.36  27.8   53.13  39.71  32.87  44.7   30.97 ]
====================================


children
[ 0.  1.  3.  2. nan -1.  4. -2.  5. -3. -4.]
====================================


smoker
['yes' 'no' nan]
====================================


region
['southwest' 'Southeast' 'southeast' 'northwest' 'Northwest' 'Northeast'
 'northeast' 'Southwest' nan]
====================================


charges
['16884.924' '1725.5523' '$4449.462' ... '$1629.8335' '2007.945'
 '29141.3603']
====================================

## The Number of missing values in each column

In [7]:
df.isnull().sum()

age         66
sex         66
bmi         66
children    66
smoker      66
region      66
charges     54
dtype: int64

## Summary Stattistics for each column

In [8]:
df.describe()

               age          bmi     children
count  1272.000000  1272.000000  1272.000000
mean     35.214623    30.560550     0.948899
std      22.478251     6.095573     1.303532
min     -64.000000    15.960000    -4.000000
25%      24.750000    26.180000     0.000000
50%      38.000000    30.210000     1.000000
75%      51.000000    34.485000     2.000000
max      64.000000    53.130000     5.000000

In [9]:
## for object column
df.describe(include='object')

         sex smoker     region charges
count   1272   1272       1272    1284
unique     6      2          8    1272
top     male     no  Southeast    $nan
freq     517   1013        172      12

## Frequency Distribution of each column

In [10]:
cols = df.columns
for col in cols:
    print(col)
    value_counts = df[col].value_counts()
    print(value_counts, '\n\n=======================================================')

age
 18.0    63
 19.0    62
 48.0    29
 46.0    28
 53.0    27
         ..
-28.0     1
-25.0     1
-56.0     1
-58.0     1
-33.0     1
Name: age, Length: 80, dtype: int64

=======================================================
sex
male      517
female    503
man        64
M          64
woman      62
F          62
Name: sex, dtype: int64

=======================================================
bmi
32.300    13
28.310     9
31.350     8
34.100     8
28.880     8
          ..
29.100     1
34.295     1
23.465     1
45.430     1
30.970     1
Name: bmi, Length: 539, dtype: int64

=======================================================
children
 0.0    551
 1.0    292
 2.0    209
 3.0    140
-1.0     20
 4.0     20
 5.0     16
-2.0     12
-3.0      9
-4.0      3
Name: children, dtype: int64

=======================================================
smoker
no     1013
yes     259
Name: smoker, dtype: int64

=======================================================
region
Southeast    172
southeast    170
southwest    164
Northwest    161
Northeast    155
northeast    153
northwest    149
Southwest    148
Name: region, dtype: int64

=======================================================
charges
$nan            12
1639.5631        2
16884.924        1
13555.0049       1
4661.28635       1
                ..
7345.084         1
26109.32905      1
$28287.89766     1
1149.3959        1
29141.3603       1
Name: charges, Length: 1272, dtype: int64

=======================================================

## Checking for dublicate rows

In [11]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1338, dtype: bool

In [12]:
duplicate = df[df.duplicated()]
  
print("Duplicate Rows :")
duplicate

Duplicate Rows :

     age  sex  bmi  children smoker region charges
780  NaN  NaN  NaN       NaN    NaN    NaN     NaN

# Summary
## List of issues the data contains:

### 1. Columns like age, children, and charges has incorrect data types.
### 2. There are missing values in all the 7 columns.
### 3. There is format error in column values of Sex and Region. 
### 4. There is bad data in column values of age, children and charges.
### 5. We have one duplicate rows.

# Data Cleansing

In [13]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1272 non-null   float64
 1   sex       1272 non-null   object
 2   bmi       1272 non-null   float64
 3   children  1272 non-null   float64
 4   smoker    1272 non-null   object
 5   region    1272 non-null   object
 6   charges   1284 non-null   object
dtypes: float64(3), object(4)
memory usage: 73.3+ KB

## Modifying improperly formatted data.
Fixing the data format for 
1. Age
2. Sex
3. Children
4. Region
5. Charges

In [15]:
### converting all the negative ages to posititve
df['age']= df['age'].abs()

In [16]:
## Correcting the catogires for sex
df['sex']= df['sex'].replace(['F','M'],['female','male'])
df['sex']= df['sex'].replace(['woman','man'],['female','male'])

In [17]:
### Correcting the categories for region
df['region']= df['region'].replace(['Southwest','Southeast'],['southwest','southeast'])
df['region']= df['region'].replace(['Northwest','Northeast'],['northwest','northeast'])

In [18]:
### Converting all the negative numbers in number of children to positive
df['children']= df['children'].abs()

In [19]:
### Removing dollar sign from charges
df['charges']=df['charges'].str.replace('$', '', regex=False)

In [20]:
for col in cols:
    print(col)

    # get a list of unique values
    unique = df[col].unique()

    if len(unique):
        print(unique, '\n====================================\n\n')
    else:
        print(str(len(unique)) + ' unique values', '\n====================================\n\n')

age
[19. 18. 28. 33. 32. 31. 46. 37. 60. 25. 62. 23. 56. 27. 52. 30. 34. 59.
 63. 55. 22. nan 26. 35. 24. 41. 21. 48. 36. 40. 58. 43. 64. 20. 61. 53.
 44. 57. 45. 54. 38. 29. 49. 47. 51. 42. 50. 39.]
====================================


sex
['female' 'male' nan]
====================================


bmi
[27.9   33.77  33.    22.705 28.88  25.74  33.44  27.74  29.83  25.84
 26.22  26.29  34.4   39.82  42.13  24.6   30.78  23.845 40.3   35.3
 36.005 32.4   34.1      nan 28.025 27.72  23.085 32.775 17.385 36.3
 35.6   26.315 28.6   28.31  36.4   20.425 32.965 20.8   36.67  39.9
 26.6   36.63  21.78  37.3   38.665 34.77  24.53  35.625 28.    34.43
 28.69  36.955 31.825 31.68  22.88  37.335 27.36  33.66  24.7   25.935
 22.42  28.9   39.1   36.19  23.98  24.75  28.5   28.1   32.01  27.4
 34.01  35.53  39.805 26.885 38.285 37.62  41.23  34.8   22.895 31.16
 27.2   26.98  39.49  24.795 31.3   30.8   38.28  19.95  19.3   31.6
 30.115 29.92  27.5   28.4   30.875 27.94  35.09  33.63  29.7   35.72
 32.205 49.06  27.17  23.37  37.1   23.75  28.975 31.35  33.915 28.785
 28.3   37.4   17.765 34.7   26.505 22.04  35.9   25.555 28.05  25.175
 31.9   36.    32.49  25.3   29.735 38.83  30.495 37.73  37.43  24.13
 37.145 25.46  39.52  24.42  27.83  36.85  39.6   29.8   29.64  28.215
 37.    33.155 18.905 41.47  30.3   15.96  33.345 37.7   27.835 29.2
 28.595 26.41  30.69  41.895 30.9   32.2   32.11  31.57  26.2   30.59
 32.8   18.05  39.33  32.23  24.035 36.08  22.3   26.4   31.8   26.73
 23.1   23.21  33.7   33.25  24.64  33.88  38.06  41.91  31.635 36.195
 17.8   24.51  22.22  29.07  22.135 26.8   30.02  20.9   17.29  34.21
 25.365 40.15  24.415 25.2   26.84  24.32  42.35  19.8   32.395 30.2
 34.2   37.05  27.455 27.55  20.615 24.3   31.79  21.56  28.12  40.565
 27.645 31.2   26.62  48.07  36.765 33.4   45.54  28.82  22.99  27.7
 25.41  22.61  37.51  38.    33.33  34.865 35.86  31.4   25.27  40.945
 34.105 36.48  33.8   36.7   36.385 34.5   32.3   27.6   29.26  23.18
 25.6   35.245 43.89  20.79  30.5   21.7   21.89  32.015 30.4   21.09
 22.23  32.9   24.89  31.46  17.955 30.685 43.34  39.05  30.21  31.445
 19.855 31.02  38.17  20.6   47.52  20.4   24.31  23.6   21.12  30.03
 17.48  20.235 17.195 23.9   35.15  22.6   39.16  27.265 29.165 16.815
 26.9   33.11  31.73  46.75  29.45  32.68  33.5   43.01  36.52  26.695
 33.1   29.6   38.6   23.4   46.53  30.14  30.    28.38  28.7   33.82
 24.09  32.67  25.1   32.56  41.325 39.5   34.3   31.065 21.47  25.08
 43.4   25.7   27.93  39.2   26.03  30.25  28.93  35.7   35.31  31.
 44.22  26.07  25.8   39.425 40.48  38.9   47.41  35.435 46.7   46.2
 21.4   23.8   44.77  32.12  29.1   37.29  36.86  34.295 38.095 23.465
 45.43  23.65  20.7   28.27  35.91  29.    19.57  31.13  21.85  33.725
 29.48  32.6   37.525 23.655 37.8   29.37  19.    21.3   33.535 42.46
 38.95  36.1   29.3   39.7   38.19  42.4   34.96  42.68  35.2   31.54
 29.81  21.375 40.81  17.4   20.3   18.5   26.125 41.69  24.1   36.2
 40.185 35.75  39.27  34.87  44.745 29.545 23.54  40.47  40.66  36.6
 35.4   27.075 28.405 21.755 40.28  30.1   32.1   38.39  23.7   35.5
 29.15  27.    37.905 22.77  22.8   34.58  27.1   19.475 26.7   34.32
 41.14  35.97  22.515 41.8   31.92  26.18  42.24  26.51  35.815 36.575
 42.94  21.01  24.225 17.67  34.39  31.5   31.1   32.78  32.45  50.38
 47.6   25.4   29.9   43.7   24.86  28.8   29.5   29.04  44.    20.045
 40.26  35.1   29.355 32.34  39.8   24.605 33.99  28.2   25.    33.2
 23.2   20.1   32.5   37.18  46.09  39.93  35.8   31.255 18.335 42.9
 26.79  39.615 25.9   25.745 28.16  23.56  40.5   35.42  39.995 34.675
 20.52  23.275 36.29  32.7   19.19  24.985 20.13  23.32  45.32  34.6
 18.715 21.565 38.38  23.    37.07  42.655 21.66  29.59  32.    18.3
 47.74  22.1   19.095 38.94  31.24  29.925 20.35  25.85  42.75  18.6
 23.87  45.9   21.5   30.305 44.88  41.1   40.37  28.49  33.55  40.375
 27.28  17.86  33.3   39.14  21.945 24.97  23.94  34.485 21.8   23.3
 36.96  21.28  29.4   27.3   37.9   37.715 23.76  25.52  27.61  27.06
 39.4   34.9   22.    30.36  27.8   53.13  39.71  32.87  44.7   30.97 ]
====================================


children
[ 0.  1.  3.  2. nan  4.  5.]
====================================


smoker
['yes' 'no' nan]
====================================


region
['southwest' 'southeast' 'northwest' 'northeast' nan]
====================================


charges
['16884.924' '1725.5523' '4449.462' ... '1629.8335' '2007.945'
 '29141.3603']
====================================

# Changing data types

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1272 non-null   float64
 1   sex       1272 non-null   object
 2   bmi       1272 non-null   float64
 3   children  1272 non-null   float64
 4   smoker    1272 non-null   object
 5   region    1272 non-null   object
 6   charges   1284 non-null   object
dtypes: float64(3), object(4)
memory usage: 73.3+ KB

In [22]:
df['charges']

0         16884.924
1         1725.5523
2          4449.462
3       21984.47061
4         3866.8552
           ...
1333     10600.5483
1334      2205.9808
1335      1629.8335
1336       2007.945
1337     29141.3603
Name: charges, Length: 1338, dtype: object

In [23]:
df['age'] = df['age'].astype("Int64")
df['children']= df['children'].astype("Int64")
df['charges'] = pd.to_numeric(df['charges'], errors='coerce')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1272 non-null   Int64
 1   sex       1272 non-null   object
 2   bmi       1272 non-null   float64
 3   children  1272 non-null   Int64
 4   smoker    1272 non-null   object
 5   region    1272 non-null   object
 6   charges   1272 non-null   float64
dtypes: Int64(2), float64(2), object(3)
memory usage: 75.9+ KB

## Handling Missing Values

In [25]:
### Number of missing values in each column
df.isnull().sum()

age         66
sex         66
bmi         66
children    66
smoker      66
region      66
charges     66
dtype: int64

In [26]:
# Finding the mean for dataframe  age column
mean_value= df['age'].mean()
round(mean_value)

39

In [27]:
df['age'].fillna(round(df['age'].mean()), inplace= True)

In [28]:
### Finding the mean for dataframe charges column 
mean_value_smoker= df[df['smoker']== 'yes']['charges'].mean()
mean_value_smoker

32067.769926732286

In [29]:
df['charges'].fillna(mean_value_smoker, inplace= True)

In [30]:
### find the first mode for the data column
df['children'].fillna(df['children'].mode()[0], inplace=True)
df['bmi'].fillna(df['bmi'].mode()[0], inplace=True)

In [31]:
### Replace "Unknown" for  missing values in columns like sex, smoker, region
df['sex'].fillna('Unknown', inplace= True)
df['smoker'].fillna('Unknown', inplace= True)
df['region'].fillna('Unknown', inplace= True)

In [32]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Dropping duplicate rows

In [33]:
df.drop_duplicates(inplace=True)

In [34]:
print("Re-checking the number of duplicate observations:")
df.duplicated().sum()

Re-checking the number of duplicate observations:

0

# CHECKING DATA AFTER CLEANSING

In [35]:
# Reseting the index of the DataFrame
df.reset_index(drop=True, inplace = True)

In [37]:
# the column name and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1335 entries, 0 to 1334
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1335 non-null   Int64
 1   sex       1335 non-null   object
 2   bmi       1335 non-null   float64
 3   children  1335 non-null   Int64
 4   smoker    1335 non-null   object
 5   region    1335 non-null   object
 6   charges   1335 non-null   float64
dtypes: Int64(2), float64(2), object(3)
memory usage: 75.7+ KB

In [38]:
cols= df.columns
# the unique values for each column if no. of values < 30, otherwise printing the number of unique values
for col in cols:
    # printing the column name
    print(col)

    # getting a list of unique values for that column
    unique = df[col].unique()

    # if number of unique values is less than 30, print the values. Otherwise print the number of unique values
    if len(unique)<30:
        print(unique, '\n====================================\n\n')
    else:
        print(str(len(unique)) + ' unique values', '\n====================================\n\n')

age
47 unique values
====================================


sex
['female' 'male' 'Unknown']
====================================


bmi
539 unique values
====================================


children
<IntegerArray>
[0, 1, 3, 2, 4, 5]
Length: 6, dtype: Int64
====================================


smoker
['yes' 'no' 'Unknown']
====================================


region
['southwest' 'southeast' 'northwest' 'northeast' 'Unknown']
====================================


charges
1272 unique values
====================================

In [39]:
# the number of missing values of each column:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [40]:
# The number of duplicate observations left
df.duplicated().sum()

0

In [41]:
# Reset the index of the DataFrame
df.reset_index(drop=True, inplace = True)
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1330   50    male  30.970         3     no  northwest  10600.54830
1331   18  female  31.920         0     no  northeast   2205.98080
1332   18  female  36.850         0     no  southeast   1629.83350
1333   21  female  25.800         0     no  southwest   2007.94500
1334   61  female  29.070         0    yes  northwest  29141.36030

[1335 rows x 7 columns]

# Export the cleaned dataset to a csv file

In [42]:
#Exporting data into csv file
df.to_csv("Cleaned_Insurance.csv", index= False)